Revit 2027 API
ExporterIFCUtils.GetLevelIdByHeight Method
 Gets the level if by the height of the element.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId GetLevelIdByHeight(
	ExporterIFC exporterIFC,
	Element elem
)
Public Shared Function GetLevelIdByHeight (
	exporterIFC As ExporterIFC,
	elem As Element
) As ElementId
public:
static ElementId^ GetLevelIdByHeight(
	ExporterIFC^ exporterIFC,
	Element^ elem
)
static member GetLevelIdByHeight :
        exporterIFC : ExporterIFC *
        elem : Element -> ElementId
Parameters
exporterIFC ExporterIFC
 The exporter.
elem Element
 The element.
Return Value
ElementId
 The level id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace